Repository: 84000/data-translation-memory
Catalog: toh248-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་སོ་སོར་ཐར་པ་ཆོས་བཞི་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Great Vehicle Sūtra The Fourfold Accomplishments: The Bodhisattvas’ Prātimokṣa

source: བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Blessed Mañjuśrī Kumārabhūta!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ལ་སོགས་པ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དུ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: Thus did I hear at one time. The Blessed One was staying at Vulture Peak near Rājagṛha together with a great saṅgha of 1,250 monks—Venerable Śāriputra, Maudgalyāyana, and others—who were all worthy ones, whose defilements were exhausted, who were without afflictions, and who had gained mastery. A great many bodhisattva great beings were also present.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། ། ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པའི་རྣམ་པའི་བྱ་བ་ནི་གང་། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བདེན་པར་སྨྲ་ཞིང་ཡང་དག་པར་སྨྲ་བས་མྱུར་དུ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then it happened that Venerable Śāriputra went before the Blessed One, bowed down at his feet, and sat to one side. While seated to one side, Venerable Śāriputra asked the Blessed One, “Blessed One, what are the deeds related to the aspects of the bodhisattvas’ truth? Blessed One, how do bodhisattvas speak truthfully and genuinely, thereby quickly awakening in a perfect manner to unexcelled and perfect buddhahood?”

source: ཤཱ་རིའི་བུ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བདེན་པར་སྨྲ་ཞིང་ཡང་དག་པར་སྨྲ་བ་ཡིན་ཏེ། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: The Blessed One replied to Venerable Śāriputra, “Śāriputra, when bodhisattvas have four qualities they speak truthfully and genuinely, and will quickly awaken in a perfect manner to unexcelled and perfect buddhahood. What are these four?

source: བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བརྩོན་འགྲུས་བརྩམས་པས་གནས་པ་ཡིན་ཏེ ཤཱ་རིའི་བུ་དཔེར་ན་སྐྱེས་བུ་གྲོང་ཁྱེར་གྱི་ཚད་འཇལ་བར་འདོད་པ་དེ་གྲོང་ཁྱེར་གྱི་བྱ་བ་ལ་བརྩོན་པ་སྐྱེད་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་སྐྱེས་བུ་དེའི་གྲོང་ཁྱེར་དེ་ཡང་དག་པར་འགྱུར་བ་དང་། མི་རྣམས་གྲོང་ཁྱེར་དུ་གནས་པར་འགྱུར་རོ། ། ཞེས་རེ་བར་བྱ་བ་ཡིན་ལ། གྲོང་ཁྱེར་དུ་སོ་སོར་འཇོག་པར་འདོད་པས་ཀྱང་ཡང་དག་པའི་ཤེས་རབ་ལ་བརྟེན་ནས་གནས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་དུས་གང་གི་ཚེ་དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་རྩོམ་པ་ལ་གནས་ཏེ་ ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་གང་གིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པའི་རྣམ་པ་དང་པོའོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐོས་པ་ནན་ཏན་གྱིས་སྒྲུབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་ཆོས་རྣམས་མྱུར་དུ་སྨིན་པར་འགྱུར་ཏེ།
en: “Śāriputra, in their pursuit of all virtuous qualities, noble sons or noble daughters generate the mind set on unexcelled and perfect buddhahood, and then practice the application of diligence. Śāriputra, as an analogy, when a man wishes to survey a city, he first generates effort regarding what is to be done for the city. Śāriputra, he then hopes that the city will develop, and that people will come to live there. Wishing to settle in that city, he comes to know all its places based on genuine insight. Similarly, Śāriputra, in their pursuit of all virtuous qualities, bodhisattvas practice the application of diligence and comprehend all qualities. Śāriputra, this way of quickly awakening in a perfect manner to unexcelled and perfect buddhahood is the first aspect of the bodhisattvas’ truth.

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་ནད་ཀྱིས་ཐེབས་པར་གྱུར་པ་དེ་ལ་སྨན་པས་སྨན་ཉེ་བར་བསྟན་ལ། དེས་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་སོ་སོར་བསྟེན་པས་ནད་དེ་ལས་མྱུར་དུ་ཐར་བར་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེས་སྨན་ཚུལ་བཞིན་དུ་སོ་སོར་བསྟེན་པའི་ཕྱིར་རོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐོས་པ་ནན་ཏན་གྱིས་སྒྲུབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་དགེ་བའི་ཆོས་རྣམས་མྱུར་དུ་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གང་གིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པའི་རྣམ་པ་གཉིས་པའོ། །
en: “Furthermore, Śāriputra, bodhisattvas who study the Dharma with earnest application will quickly ripen virtuous qualities. As an analogy, Śāriputra, when a doctor prescribes medicine to someone suffering from an illness, the person who carefully follows the doctor’s instructions will quickly recover from that illness. Why? Because that person has properly and carefully followed the doctor’s prescription. Similarly, Śāriputra, the virtuous qualities of bodhisattvas who study the Dharma with earnest application will quickly ripen. Śāriputra, this way of quickly awakening in a perfect manner to unexcelled and perfect buddhahood is the second aspect of the bodhisattvas’ truth.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དེ་ཆོས་ཅུང་ཟད་ཀྱང་མི་ལེན་ཏོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཉེ་བར་ལེན་པ་ལས་ནི་འཇིགས་པ་འབྱུང་བས་ཆོས་ཐམས་ཅད་ལ་འཇིགས་པའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དེ། འཇིགས་པའི་འདུ་ཤེས་སྐྱེད་པ་ལས་ནི་ཡིད་རྟོན་པར་མི་བྱེད་དོ། ། ཡིད་མི་རྟོན་པ་ཡོད་ན་ཇི་ལྟར་ཐར་པར་བྱ། ཇི་ལྟར་ན་བདེ་ལེགས་སུ་གནས་པར་འགྱུར་ཞེས་ལམ་ཚོལ་བར་བྱེད་དོ། །
en: “Furthermore, Śāriputra, bodhisattvas do not cling to any phenomenon in the slightest while they perceive all phenomena as being alien. Why? Because they seek out the path while thinking, ‘Since danger arises from appropriation, I perceive danger in all phenomena. Perceiving danger, I do not rely on them. If they are unreliable, how will I be free? How will I be happy?’

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ཡོད་ན་ བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཇི་ལྟར་ཐར་བར་བྱ། ཇི་ལྟར་ན་བདེ་ལེགས་སུ་གནས་པར་འགྱུར་ཞེས་ལམ་ཡོངས་སུ་ཚོལ་ཞིང་ཕྱོགས་བཞིར་ལེགས་པར་གསུངས་པ་ཡོངས་སུ་ཚོལ་ལོ། ། ཤཱ་རིའི་བུ་གང་གིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པའི་རྣམ་པ་གསུམ་པའོ། །
en: “Furthermore, Śāriputra, bodhisattvas seek out the path and seek out the well-spoken teachings in the four directions while thinking, ‘If one is completely enveloped by birth, aging, sickness, death, sorrow, lamentation, suffering, unhappiness, and distress, how will there be freedom in unexcelled and perfect buddhahood? How will there be happiness?’ Śāriputra, this way of quickly awakening in a perfect manner to unexcelled and perfect buddhahood is the third aspect of the bodhisattvas’ truth.

source: ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་བདག་ཏུ་འགྱུར་བ་དང་། སྡུག་བསྔལ་གྱི་ཆོས་རྣམས་ཀྱིས་ཡོངས་སུ་མི་སྐྲག་ཅིང་མ་གོས་པས་རྟག་ཏུ་བརྩོན་པ་དང་ལྡན་པ་ཡིན་ཏེ སེམས་ཅན་གང་སུ་དག་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་བྱུང་བ་ཉེ་བར་ཞི་བར་བྱ་བའི་ཕྱིར་བདག་གིས་དེ་དག་བསལ་བར་བྱའོ་ཞེས་སེམས་སྐྱེད་པར་བྱེད་ཅིང་ཇི་ལྟར་བདག་ལ་ཟག་པ་མེད་པའི་བདེ་བ་མྱོང་བ་སྐྱེས་པ་དེ་བཞིན་དུ་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བསྒྲུབ་པར་བྱའོ་ཞེས་བརྩོན་འགྲུས་རྩོམ་པར་བྱེད་དོ། ། དེ་དེ་ལྟར་བརྩོན་འགྲུས་རྩོམ་པ་ན་རྙེད་པའི་འདུ་ཤེས་སྐྱེད་པར་མི་བྱེད་དོ། ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་དབྱར་ཟླ་འབྲིང་པོའི་ཟླ་བ་ལ་འབྲོག་དགོན་པར་སོང་བ་ན།
en: “Furthermore, Śāriputra, bodhisattvas become benefactors, and since they are totally unafraid of and untainted by the phenomena of suffering, they maintain constant diligence. They arouse the determination that thinks, ‘I will clear away whatever suffering, unhappiness, and distress that arises in sentient beings in order to bring them to peace.’ They practice the application of diligence while thinking, ‘I will induce in all sentient beings the same experience of uncontaminated bliss that has arisen in me.’

source: འབྲོག་དགོན་པ་དེ་ན་ཡང་མི་རྒྱུ་བ་མེད་ལ་ཤིང་མེད་ཅིང་ཆུ་མེད་པ་དང་། དེའི་སྟེང་ནས་ཉི་མའི་དཀྱིལ་འཁོར་ཡང་ཤར་བར་གྱུར། དེར་ས་གཞི་ཡང་རབ་ཏུ་འབར་ཞིང་ཚ་བར་གྱུར་ཏེ། དེའི་མདུན་དུ་ཆུ་བོའི་རྒྱུན་ཆེན་པོ་འབབ་པར་གྱུར་པ་ན་དེ་དེ་ལ་ངོ་མཚར་གྱི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་སྡུག་བསྔལ་ཟད་པར་འགྱུར་བའི་ལམ་ཇི་ལྟ་བུ་བཟུང་ལ། གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལམ་དེ་ཡོངས་སུ་བཟུང་ཡང་བསྐལ་པ་བྱེ་བ་འདས་ནས་ ཐ་ན་འདུག་པ་ཙམ་གྱི་བདེ་བ་འདོད་པའི་སེམས་གཅིག་སྐྱེས་ན་ ཡང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་སེམས་གཟེངས་བསྟོད་པར་བྱ་སྟེ བདག་གིས་གང་གཟུང་ནས་འདུག་པ་དེ་ཡང་མང་དུ་ཡིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་གནོང་བསྐུར་རོ། ། ཤཱ་རིའི་བུ་གང་གིས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདེན་པའི་རྣམ་པ་བཞི་པའོ། །
en: “When they apply diligence, they do not conceive of profit. As an analogy, Śāriputra, consider people travelling through a wasteland in the middle of the summer, where there are no humans passing through, no trees or water, and the sun shines down, scorching and burning the ground. If a great river were to appear, flowing in front of those people, it would be a marvelous sight for them. Similarly, Śāriputra, for the sake of all sentient beings, bodhisattvas follow such a path that brings an end to suffering. Even if, after ten million eons, bodhisattvas who follow that path give rise to a single thought of desire for the relief of a bit of rest, they should encourage themselves, saying, ‘There are many in my care; I will acknowledge my faults for the sake of all sentient beings.’ Śāriputra, this way of quickly awakening in a perfect manner to unexcelled and perfect buddhahood is the fourth aspect of the bodhisattvas’ truth.

source: ཤཱ་རིའི་བུ་ཅིའི་ཕྱིར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ཞེས་བྱ་ཞེ་ན། མ་མཁྱེན་པའི་མཁྱེན་པ་མཁྱེན་པས་མངོན་པར་མཁྱེན་པ་དང་། མཁྱེན་པའི་ཆོས་དེ་ལ་རབ་ཏུ་གནས་པས་སྤྱོད་པ་དེས་ན་མངོན་པར་སངས་རྒྱས་པ་ཞེས་བྱའོ། ། བླ་ན་མེད་པ་ཞེས་བྱ་བ་ཡང་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་རྡུལ་ཙམ་ཡང་ལུས་ཤིང་མ་རྒལ་བ་མེད་པ་དེས་ན་དེ་བཞིན་གཤེགས་པ་སྟེ་ཕ་རོལ་ཏུ་བྱོན་པ་ཞེས་བྱའོ། །
en: “Śāriputra, what is meant by awakening in a perfect manner? It is said to be awakening in a perfect manner since it is the knowledge of what has not been known, and being intent on the phenomena that are known. It is also said to be unexcelled, since not even the slightest particle of any phenomenon is left out or passed over by the thus-gone ones. Therefore, they are said to have gone thus and to have reached the other shore.

source: ཤཱ་རིའི་བུ་ཅིའི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་ཞེ་ན། ཐུགས་མཉམ་པ་དང་། ཐུགས་རྙོག་པ་མེད་པ་དང་། ཐུགས་མི་འཁྲུགས་པས་ཆོས་རྣམས་མངོན་པར་མཁྱེན་པ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མེད་པར་མངོན་པར་མཁྱེན་པ་དེས་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །
en: “Śāriputra, what is meant by perfect buddhahood? Phenomena are known by a mind that is balanced, clear, and undisturbed. The knowledge of the sameness of all phenomena and of the lack of difference in all phenomena is said to be perfect buddhahood.

source: ཤཱ་རིའི་བུ་ཆོས་འདི་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བརྩོན་འགྲུས་མི་འཕྲོགས་པར་གྱུར་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: “Śāriputra, the diligence of bodhisattvas endowed with those four qualities is insuperable. Untainted by any affliction, they will awaken in a perfect manner to unexcelled and perfect buddhahood.

source: ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་བཞི་སྒྲུབ་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་མཁྱེན་པ་དང་། གཟིགས་པ་དང་། ཐུགས་སུ་ཆུད་པ་དང་། བརྙེས་པ་དང་། མངོན་སུམ་དུ་མཛད་པས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡིན་ཏེ བྱང་ཆུབ་སེམས་དཔའ་གནས་དེ་དག་ལས་མ་ཉམས་ཤིང་བསྒྲུབ་པའི་རྣམ་པ་ཀུན་རྫོགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: “Śāriputra, because this fourfold accomplishment of the bodhisattvas’ qualities is known, seen, realized, attained, and actualized by the thus-gone ones, it is awakening in a perfect manner. Because bodhisattvas do not fall from those states and perfect all aspects of accomplishment, they will awaken in a perfect manner to unexcelled and perfect buddhahood.

source: ཤཱ་རིའི་བུ་ཆོས་བཞི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔས་བསྔགས་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་ང་རྒྱལ་ཅན་དུ་མི་འགྱུར་བ་ཡིན། ང་རྒྱལ་ཚར་གཅོད་པའི་ཕྱིར་ཞུགས་པ་ཡིན། ཆགས་པ་མེད་པར་འགྱུར་བ་ཡིན། ཆགས་པ་སྤོང་བའི་ཕྱིར་ཞུགས་པ་ཡིན། ཞེ་སྡང་མེད་པར་འགྱུར་བ་ཡིན། བྱམས་པ་བསྒོམ་པ་ལ་མངོན་པར་དགའ་བ་ཡིན། རྨོངས་པ་མེད་པར་འགྱུར་བ་ཡིན། ཤེས་རབ་ཀྱི་སྟོབས་དང་ལྡན་པ་ཡིན། ཤེས་རབ་ཉེ་བར་རྟོན་པ་ཡིན། ཤེས་རབ་ཀྱིས་སྤྱོད་པ་ཡིན། ཤེས་རབ་ཀྱི་བདག་པོར་གྱུར་པ་ཡིན། ཤེས་རབ་ཀྱིས་ངེས་པར་འབྱུང་བ་ཡིན། རྨོངས་པའི་དྲ་བ་སྤོང་བའི་ཕྱིར་ཞུགས་པ་ཡིན། མུན་པ་མུན་ནག་འཇོམས་པའི་ཕྱིར་ཞུགས་པ་ཡིན། ཤེས་རབ་ཀྱི་རྒྱུ་ལྷུར་ལེན་ཅིང་མཐུ་དང་ལྡན་པ་ཡིན། ཤེས་རབ་ངེས་པར་རྙེད་པ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་ཆོས་དང་པོ་འདི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཐར་པའི་བྱ་བ་དོན་དུ་གཉེར་བ་ཡིན་ཏེ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་ཞིག་བུ་གཅིག་པ་སྡུག་ཅིང་ཡིད་དུ་འོང་བ་མི་འཐུན་པ་མེད་པ་དེ་རྒྱལ་པོས་གསད་སར་བོར་བ་མཐོང་བར་གྱུར་ལ། དེའི་ཕ་དང་མ་ཀྱེ་མའོ་བུ་གཅིག་པ་ཀྱི་ཧུད་བུ་གཅིག་བདག་ཅག་འབོར་རམ་ཞེས་ཀུན་ཏུ་སྨྲ་ཞིང་སྨྲེ་སྔགས་འདོན་པས་རྣམ་པར་སྨྲ་བར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་དུས་གང་གི་ཚེ་ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་གང་ཡང་རུང་བ་ཞིག་སྡིག་པ་བྱེད་པ་མཐོང་བ་ན། །
en: “Śāriputra, bodhisattvas who have four qualities will be praised. What are these four? Śāriputra, bodhisattvas are not excessively proud—they have set out to annihilate pride. They have no attachments—they have set out to abandon attachment. They have no anger—they delight in cultivating loving-kindness. They are without delusion—they possess the strength of insight. They hew closely to insight. They act insightfully. They are masters of insight. Insight motivates their renunciation. They have set out to abandon the web of delusion. They have set out to overcome darkness and gloom. They are powerful and dedicated to the causes of insight. They are certain to achieve insight. Śāriputra, bodhisattvas who have these first qualities will be praised.

source: ཀྱེ་མའོ་གང་དུ་སེམས་ཅན་ཤེས་རབ་འཆལ་བ་རྣམས་ནི་བདག་གི་ཡང་དག་པའི་འཚོ་བ་ལས་རྣམ་པར་ཉམས་པར་བྱེད་དོ། ། ཞེས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་སྐྱེ་བར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་བསྲུང་ངོ་སྙམ་ན་བདག་བསྲུང་བར་བྱའོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཕན་པ་འདོད་པ་འདི་ལྟ་བུ་དང་ལྡན་པས་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མི་བྱེད་དོ། ། ཤཱ་རིའི་བུ་ཆོས་གཉིས་པོ་འདི་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྔགས་པའི་བྱ་བ་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བསྟི་སྟང་གིས་ཆོས་ཚོལ་བར་བྱེད་ཅིང་བསྟི་སྟང་གིས་ཆོས་ཡོངས་སུ་འཛིན་པར་བྱེད་ལ། བསྟི་སྟང་གིས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བསྟི་སྟང་གིས་ཆོས་བཙལ་བར་བྱ་ཞེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདོད་པ་མཁན་པོ་དང་སློབ་དཔོན་ལ་གུས་པས་གང་ཡོངས་སུ་མི་གཏོང་བའི་རིན་པོ་ཆེ་དེ་འཇིག་རྟེན་ན་མེད་དོ། ། གང་ལུས་ཀྱིས་རིམ་གྲོ་མི་བྱེད་པ་དེ་མེད་དོ། ། གང་རྐང་པས་བཏང་བ་ལ་མི་སྤྲོ་བ་མེད་དོ། ། གང་ངག་གི་ལས་ལ་མི་སྤྲོ་བ་དེ་མེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཆོས་རིན་པོ་ཆེ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་ཁྱད་པར་ཅན་དུ་གྱུར་པ་ཡིན་པས་བདག་གིས་རིན་པོ་ཆེ་ཐམས་ཅད་བཏང་ནས་ཆོས་རིན་པོ་ཆེ་བཙལ་ཞིང་གཟུང་བར་བྱའོ། །
en: “Furthermore, Śāriputra, bodhisattvas strive to liberate sentient beings. As an analogy, Śāriputra, if parents were to see their beloved, attractive, and pleasing only son sent by the king to the place of his execution, they would wail and lament, ‘Oh no! Our only son! Alas! Our only son! How can we abandon him?’ Similarly, Śāriputra, when bodhisattvas with perfect intentions see any sentient being engaged in negative actions, compassion will be born in them, and they will exclaim, ‘Oh no! Sentient beings with faulty insight stray from their correct livelihood!’ Śāriputra, those who think about guarding others should guard themselves. Śāriputra, because bodhisattvas have such a desire to benefit, they will not commit a single negative action, even to save their life. Śāriputra, bodhisattvas who have these two qualities will be praised.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་འདི་ནི་འཆིང་བ་ཐམས་ཅད་གཅོད་པར་འགྱུར་བའོ། ། ཆོས་འདི་ནི་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་གཅོད་པར་འགྱུར་བའོ་སྙམ་ནས་ རིན་པོ་ཆེའི་སེམས་བསྐྱེད། རྙེད་དཀའ་བའི་སེམས་བསྐྱེད། སྨན་གྱི་སེམས་བསྐྱེད་དེ། ཆོས་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཉེ་བར་ཞི་བར་བྱེད་པར་འགྱུར་བས། བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཉེ་བར་ཞི་བར་བྱ་བའི་ཕྱིར་ཆོས་འདི་ལྟ་བུ་བཙལ་བར་བྱའོ་ཞེས་དེ་ལྟ་བུའི་བསམ་པས་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཚོལ་བར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔས་རིན་ཐང་མེད་པའི་སེམས་བསྐྱེད་ཅིང་བསྟི་སྟང་གིས་ཆོས་འཛིན་པར་བྱེད་ཅེ་ན། དེ་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པའི་ཆེད་དུ་རི་རབ་ཙམ་གྱི་རིན་པོ་ཆེའི་ཕུང་པོ་ཡོངས་སུ་བཏང་ཡང་དེ་ལ་དཀའ་བའི་འདུ་ཤེས་མི་སྐྱེད་ཀྱི། ཅི་སྟེ་གང་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་འདི་འཛིན་པ་དེ་ཉིད་ལ་ནི་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་དོ། །
en: “Furthermore, Śāriputra, bodhisattvas devotedly seek out the Dharma, devotedly uphold the Dharma, and devotedly practice giving the gift of the Dharma. Śāriputra, how do bodhisattvas devotedly seek out the Dharma? Śāriputra, bodhisattvas who wish for the Dharma pay respect to preceptors and teachers while thinking, ‘There is no jewel in the world I would not give away for it! There is nothing I would not do to honor it with my body! There is no distance I would not walk for it! There is no verbal act I would not perform for it! Why? Because the jewel of Dharma is the most precious jewel of all, so I will abandon all other jewels to seek out the jewel of Dharma and uphold it. Why? Because the Dharma severs all fetters; it severs birth, aging, sickness, death, sorrow, lamentation, suffering, and unhappiness!’ Thinking in this way, they arouse the thought that it is precious. They arouse the thought that it is difficult to find. They arouse the thought that it is medicine. Śāriputra, bodhisattvas seek out the Dharma while thinking, ‘Because this Dharma cures the ills of all sentient beings, I should seek this Dharma so as to to cure the ills of all sentient beings.’

source: ཆོས་ཀྱི་ཚིག་གཅིག་གི་ཆེད་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་བ་སྲིད་པའི་རྩེ་མོ་དང་མཉམ་པ་འདི་ཡོངས་སུ་གཏོང་ཡང་དེ་ལ་ནི་དཀའ་བའི་འདུ་ཤེས་མི་སྐྱེད་ཀྱི། ཅི་སྟེ་གང་ཆོས་ཀྱི་ཚིག་གཅིག་པོ་འདི་འཛིན་པ་དེ་ཉིད་ལ་ནི་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་དོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་གུས་པ་དང་། དེ་ལྟ་བུའི་རི་མོར་བྱེད་པས་ཆོས་ཡོངས་སུ་འཛིན་པར་བྱེད་དེ། ཤཱ་རིའི་བུ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ངོ་མཚར་ཡིན་ནོ། །
en: “Śāriputra, how do bodhisattvas arouse the thought that Dharma is priceless and devotedly uphold it? For the sake of a single four-line verse, they would give away heaps of jewels the size of Mount Meru, and they would not perceive any difficulty in that. Yet they perceive the difficulty in upholding that single four-line verse. For the sake of a single word of the Dharma, they would give away the trichiliocosm filled up to the pinnacle of existence with the seven types of jewels, and they would not perceive any difficulty that. Yet they perceive the difficulty in upholding that single word of the Dharma. Śāriputra, bodhisattvas uphold the Dharma with this kind of respect and honor. This, Śāriputra, is a marvel of the bodhisattvas.

source: ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་སྐྱེས་བུ་སྲོག་དོན་དུ་གཉེར་བས་སྲོག་གི་ཕྱིར་རིན་པོ་ཆེའི་ཕུང་པོ་འདི་ཙམ་ཡོངས་སུ་གཏོང་བ་ཡོད་དམ། གསོལ་བ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདོད་པས་ཆོས་ཀྱི་ཚིག་གཅིག་གི་དོན་གྱི་ཕྱིར་ཡང་བདག་ཉིད་ཚངས་པའི་འཇིག་རྟེན་ནས་འདོར་བའམ། ཡང་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མེས་ཡོངས་སུ་གང་བ་འདི་ལ་འཇུག་ཏུ་ཟིན་ཀྱང་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་པར་མི་བྱེད་ཀྱི། ཅི་སྟེ་གང་ཆོས་ཀྱི་ཚིག་འདི་འཛིན་པ་དེ་ཉིད་ལ་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དེ
en: “Śāriputra, what do you think—is it out of concern for their life, for the sake of their life, that they would give away those heaps of jewels?” “No, Blessed One.” “Śāriputra,” continued the Blessed One, “for the sake of a single word of the Dharma, bodhisattva great beings who wish for the Dharma may cast themselves from the world of Brahmā or enter the trichiliocosm when it is completely filled with fire, and they would not perceive any difficulty in that. Yet they perceive the difficulty in upholding that single word of the Dharma. Śāriputra, this is how bodhisattvas devotedly uphold the Dharma.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བསྟི་སྟང་གིས་ཆོས་ཡོངས་སུ་འཛིན་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བསྟི་སྟང་དུ་བྱེད་པས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་ཅེ་ན། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་ན་ཟང་ཟིང་གི་སེམས་སྐྱེད་པར་མི་བྱེད་དེ། བདག་གི་སྦྱིན་པ་འདི་ལས་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་རྙེད་པར་འགྱུར་བའམ། ཐ་ན་བདག་གི་སྦྱིན་པ་འདི་ལས་ལེགས་སོ་ཞེས་བྱ་བ་ཡང་རྙེད་པར་འགྱུར་རོ། ། ཞེས་སྐྱེས་བུ་དམ་པ་དེ་དེ་ལྟ་བུའི་བསམ་པས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་མི་བྱེད་དོ། ། འོན་ཀྱང་ཇི་ལྟར་སེམས་ཅན་འདི་དག་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་ཐར་བར་བྱ་ཞེས་དེ་ལྟར་སྦྱིན་པར་བྱེད་དེ ཤཱ་རིའི་བུ་སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་དེ་ལྟ་བུའི་བསམ་པ་དང་། དེ་ལྟ་བུའི་ཚུལ་གྱིས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་དོ། །
en: “Śāriputra, how do bodhisattvas devotedly practice giving the gift of the Dharma? Śāriputra, when bodhisattvas practice giving the gift of the Dharma, they are not concerned with material things. Holy beings do not practice giving the gift of the Dharma while thinking, ‘Through my generosity, I will acquire robes, alms, bedding, medicine, or goods,’ or ‘I will at least be complimented for my generosity.’ Rather, they practice generosity while thinking, ‘I practice generosity to free sentient beings from birth, aging, death, sorrow, lamentation, suffering, unhappiness, and distress.’ Śāriputra, holy beings practice giving the gift of the Dharma with such thoughts and in such a manner.

source: ཤཱ་རིའི་བུ་གལ་ཏེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལ་ཞིག་འདི་སྐད་དུ་གལ་ཏེ་བདག་ལ་ཁྱེད་ཀྱིས་ལུས་བྱིན་པ་ལྟ་ན་བདག་ཁྱེད་ལས་ཆོས་ཀྱི་སྦྱིན་པ་འདི་ལེན་པར་འདོད་དོ་ཞེས་ཟེར་ན ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་དེ་ལྟ་བུའི་ཕན་པར་འདོད་པ་ཡོད་ན་ འདི་སྐད་དུ་ཁྱོད་ལ་བདག་གི་ཡན་ལག་དང་ཉིང་ལག་ལས་མཆོག་དང་མཆོག་ཏུ་གྱུར་པའི་ཤ་དག་ཀྱང་ཟོ་ཤིག །འདོད་ཆགས་ཟད་པར་བྱེད་པའི་ཆོས་འདི་ཡང་ཟུང་ཤིག་ཅེས་སྨྲ་བར་བྱེད་དེ ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུ་བྱེད་པ་ན་ཡང་དཀའ་བའི་འདུ་ཤེས་མི་སྐྱེད་ཀྱི། ཅི་སྟེ་གང་འདི་ཆོས་ཀྱི་སྦྱིན་པ་དེ་སྟེན་པ་དེ་ཉིད་ལ་ནི་དཀའ་བའི་འདུ་ཤེས་སྐྱེད་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད། དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་འཛིན་པར་བྱེད། དེ་ལྟ་བུའི་བསྟི་སྟང་གིས་ཆོས་ཚོལ་བར་བྱེད་དེ།
en: “Śāriputra, if someone said to a bodhisattva, ‘If you offered me your body, I would accept it from you as a Dharma gift.’ Śāriputra, bodhisattvas who have such a wish to benefit would reply, ‘Partake of the flesh of the best parts of my limbs and body parts! Uphold this Dharma which brings an end to desire!’ Śāriputra, bodhisattvas would not perceive any difficulty in acting in this manner. Yet they perceive the difficulty of relying on the gift of the Dharma. Śāriputra, bodhisattvas practice giving the gift of the Dharma with this kind of devotion, they uphold the Dharma with this kind of devotion, and they seek out the Dharma with this kind of devotion.
